{
    "problems" : [
        {
            "number" : 1,
            "name" : "Open-top cone",
            "difficulty" : 0,
            "contents" : "What is the volume of an open-top cone, given its height, bottom radius, and top radius?",
            "extensions" : []
        },
        {
            "number" : 13,
            "name" : "Convex hull area",
            "difficulty" : 2,
            "contents" : "Given a list of 2-dimensional coordinates, find the area of the convex hull of those coordinates.",
            "extensions" : [
                {
                    "difficulty" : 3,
                    "contents" : "Given a height map $H(x,y) = x+y$, what is the volume of the above region?"
                }
            ]
        },
        {
            "number" : 3,
            "name" : "Expected time to heads-tails sequence",
            "difficulty" : 2,
            "contents" : "Given a sequence of heads and tails `HTHHTH`, find the expected time until the sequence is seen when flipping a coin repeatedly.",
            "extensions" : [
                {
                    "difficulty" : 2,
                    "contents" : "What is the expected time until the above sequence is seen 5 times in a row?"
                },
                {
                    "difficulty" : 3,
                    "contents" : "Given an arbitrary sequence of heads and tails, find the expected time until the sequence is seen. Write a program that, given the sequence, returns the expected number of flips until the sequence is seen."
                }
            ]
        },
        {
            "number" : 4,
            "name" : "TSP",
            "difficulty" : 2,
            "contents" : "Given a list of 2-dimensional coordinates, determine the shortest time to visit all the coordinates and return to the starting point.",
            "extensions" : [
                {
                    "difficulty" : 3,
                    "contents" : "Scale the edge lengths by average endpoint distance from the origin relative to one another and give the new solution. (For example, $(0,0)-(0,1)$ has avg distance of 0.5 from origin, as does $(0,0)-(1,0)$, so nothing is scaled if these are the only two edges. But if we add $(0,9)-(0,11)$, which has an average distance from the origin of 10, that edge would be scaled up to $(\\text{distance}/\\text{min distance}) = 10/0.5 = 20$.)"
                },
                {
                    "difficulty" : 4,
                    "contents" : "Let $N(x,y)$ be the bivariate normal distribution. Choose points in $\\mathbb R^2$ with probability according to $N(x,y)$. What is the expected area enclosed by the TSP path?"
                },
                {
                    "difficulty" : 4,
                    "contents" : "Let $N(x,y)$ be the bivariate normal distribution. Choose points in $\\mathbb R^2$ with probability according to $N(x,y)$. What is the expected area enclosed by the TSP path, if you scale the edge lengths according to the above methodology?"
                }
            ]
        },
        {
            "number" : 5,
            "name" : "Quadrilateral in a square",
            "difficulty" : 4,
            "contents" : "Choose 4 random points on the perimeter of a square (they could be all on the same side of the square). What is the expected area of the resulting (convex) quadrilateral?",
            "extensions" : [
                {
                    "difficulty" : 4,
                    "contents" : "Suppose you are given a height function $H(x,y) = x+y$. What is the expected volume of quadrilateral region?"
                },
                {
                    "difficulty" : 4,
                    "contents" : "Now choose $n$ points on the square. What is the expected area (and volume, using $H(x,y)$), in terms of $n$?"
                },
                {
                    "difficulty" : 5,
                    "contents" : "Now choose $n$ points on a regular $k$-gon. What is the expected area (and volume, using $H(x,y)$), in terms of $n$ and $k$?"
                }
            ]
        },
        {
            "number" : 6,
            "name" : "Coin on a hexagon tiling",
            "difficulty" : 2,
            "contents" : "Given a tiling of hexagons with diameter 1, place a coin of diameter 1 onto the surface at random. What is the expected number of hexagons that are touched by the coin?",
            "extensions" : []
        },
        {
            "number" : 7,
            "name" : "Chord intersections",
            "difficulty" : 2,
            "contents" : "Choose 3 random chords on a circle. What is the expected number of intersections between the chords?",
            "extensions" : [
                {
                    "difficulty" : 2,
                    "contents" : "What about with $n$ chords?"
                }
            ]
        },
        {
            "number" : 8,
            "name" : "Random walk marbles",
            "difficulty" : 3,
            "contents" : "Consider a random walk on a grid (distance-1 rook moves), in which a marble is placed every $n$ steps. What is the distribution of the distance between each marble?",
            "extensions" : [
                {
                    "difficulty" : 2,
                    "contents" : "What is the distance between every 2 marbles (e.g., for path $a\\to b\\to c \\to d$, the distance between $a$ and $c$, and $b$ and $d$)?"
                }
            ]
        },
        {
            "number" : 9,
            "name" : "Enclosing random walk",
            "difficulty" : 4,
            "contents" : "Consider a random walk on a grid (distance-1 rook moves), which ends once a nonempty region has been completely enclosed by the path. What is the expected area of the enclosed region?",
            "extensions" : [
                {
                    "difficulty" : 4,
                    "contents" : "What is the expected perimeter of the enclosed region?"
                },
                {
                    "difficulty" : 4,
                    "contents" : "Let the walk continue for $n$ steps. What is the expected enclosed area formed by the path, in terms of $n$?"
                },
                {
                    "difficulty" : 4,
                    "contents" : "Let the walk continue for $n$ steps. What is the expected enclosed area of the convex hull of the enclosed regions?"
                },
                {
                    "difficulty" : 5,
                    "contents" : "Let $N(x,y)$ (the bivariate normal distribution) be the height map for the plane. Start the random walk at the origin. What is the expected volume of the first enclosed region?"
                },
                {
                    "difficulty" : 5,
                    "contents" : "Let $N(x,y)$ (the bivariate normal distribution) be the height map for the plane. Start the random walk at the origin. What is the expected volume of the enclosed regions after $n$ steps?"
                },
                {
                    "difficulty" : 5,
                    "contents" : "Suppose the probability that a step is taken in a given direction from $(x,y)$ to $(x',y')$ on the random walk is given by the relative height of $N(x',y')$, scaled so that all the direction probabilities sum to 1. How do the answers to the above questions change?"
                }
            ]
        },
        {
            "number" : 10,
            "name" : "Random shape created by lines",
            "difficulty" : 3,
            "contents" : "Pick points in $\\mathbb R^{2}$ according to $N(x,y)$ (the bivariate normal distribution) and assign them random angles (uniformly in the range $(0, 2\\pi)$) so that they create a line. Do this until there is at least one closed region. (This will be after 3 steps.) Take the closest region to the origin. What is its expected area?",
            "extensions" : [
                {
                    "difficulty" : 3,
                    "contents" : "What is the volume of the first shape, using $N(x,y)$ as the height map?"
                },
                {
                    "difficulty" : 4,
                    "contents" : "Instead of lines, instead create rays starting at the chosen point and extending in the chosen direction. (This means that the first shape will no longer be guaranteed to be created after 3 steps.) What is the first shape's expected area and what is its expected volume, using $N(x,y)$ as the height map?"
                }
            ]
        },
        {
            "number" : 11,
            "name" : "Cone closest to normal distribution",
            "difficulty" : 2,
            "contents" : "What are the dimensions of the cone in $\\mathbb R^3$ with the smallest absolute difference in overlap with the bivariate normal distribution $N(x,y)$?",
            "extensions" : []
        },
        {
            "number" : 12,
            "name" : "Random walk chase",
            "difficulty" : 3,
            "contents" : "Consider a pair of walks in $\\mathbb R^2$. The first is a random walk, making distance-1 rook moves, which starts at time zero. The second is a walk that chases the first walk, making distance-1 king moves (able to use diagonals), which starts at time 1. What is the expected time before the second walk catches the first?",
            "extensions" : [
                {
                    "difficulty" : 3,
                    "contents" : "What if the first walk instead makes knight moves, and the second walk is able to move arbitrary distances with queen moves?"
                },
                {
                    "difficulty" : 3,
                    "contents" : "What if the first walk instead makes knight moves, and the second walk is able to move arbitrary distances with bishop moves (only diagonally)?"
                }
            ]
        },
        {
            "number" : 2,
            "name" : "Rectangle inscribed in normal distribution",
            "difficulty" : 1,
            "contents" : "What is the maximum area of a rectangle inscribed inside the normal distribution?",
            "extensions" : [
                {
                    "difficulty" : 2,
                    "contents" : "What is the maximum area of an ellipse inscribed inside the normal distribution?"
                }
            ]
        },
        {
            "number" : 14,
            "name" : "Tetrahedron collision",
            "difficulty" : 3,
            "contents" : "Take two tetrahedrons of side length 1 aligned opposite each other on the $x$-axis in $\\mathbb R^3$. Move them towards (into) each other until the tip of one touches the back of the other (and vice-versa, as they are the same size). What is the total volume of the resulting shape?",
            "extensions" : [
                {
                    "difficulty" : 3,
                    "contents" : "Let $D(x,y,z) = \\sqrt{x+y+z}$ be a density function over $\\mathbb R^3$. What is the volume of the shape, given this density?"
                },
                {
                    "difficulty" : 3,
                    "contents" : "Instead of a tetrahedron, suppose you have a $k$-pyramid, where the base is a regular $k$-gon, and the sides are triangles as in the tetrahedron. What is the total volume, in terms of $k$, of the shape created by pushing the shapes into one another as before? What is its volume, using $D(x,y,z)$?"
                },
                {
                    "difficulty" : 2,
                    "contents" : "What is the volume when taking $k\\to \\infty$ (a cone)?"
                }
            ]
        },
        {
            "number" : 15,
            "name" : "Area enclosed by chords",
            "difficulty" : 3,
            "contents" : "Choose $n$ chords in a circle randomly. What is the expected area of the smallest shape enclosed by chords?",
            "extensions" : [
                {
                    "difficulty" : 3,
                    "contents" : "What is the area of the smallest polygon enclosed by the chords (the shape is only bounded by chords, not the circle)? If there is no polygon, consider its area to be 0."
                },
                {
                    "difficulty" : 3,
                    "contents" : "What is the area of the largest polygon enclosed by the chords (the shape is only bounded by chords, not the circle)? If there is no polygon, consider its area to be 0."
                }
            ]
        },
        {
            "number" : 16,
            "name" : "Pentagon packing",
            "difficulty" : 2,
            "contents" : "Suppose you have a square with sides of length 10. How much area is left after optimally packing the area with pentagons of side length 1?",
            "extensions" : [
                {
                    "difficulty" : 3,
                    "contents" : "How much area is left after optimally packing the area with regular $k$-gons?"
                },
                {
                    "difficulty" : 2,
                    "contents" : "For which $k \\geq 5$ is the packing best (uncovered area minimized)?"
                }
            ]
        },
        {
            "number" : 17,
            "name" : "Ant on a cube",
            "difficulty" : 2,
            "contents" : "Suppose there is an ant on a cube. The ant starts at a certain vertex and does a random walk along the edges of the cube, going from vertex to vertex. (At each step, the ant has a $1/3$ chance of choosing each direction.) How many steps are expected before the ant returns to its starting vertex?",
            "extensions" : [
                {
                    "difficulty" : 2,
                    "contents" : "How does this vary when the ant is instead walking on a hypercube of dimension $n\\geq 2$?"
                },
                {
                    "difficulty" : 4,
                    "contents" : "Suppose the ant is continuously walking rather than taking discrete steps. At time $t$, what is the expected (Euclidean) distance of the ant from its starting point?"
                }
            ]
        }
    ]
}